w6_simple_tdd/leap_year/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2024-10-21 Mon 10:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>チャート式ruby-III(if, case, Array.each by leap year)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content">
<h1 class="title">チャート式ruby-III(if, case, Array.each by leap year)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1fad229">1. if-elsif-else-end</a>
<ul>
<li><a href="#org60b3396">1.1. お題はうるう年</a></li>
<li><a href="#org105e6a5">1.2. 簡単な解説:if-elsif-else-end</a></li>
<li><a href="#org2cebc58">1.3. 詳しい解法:2004年はleap year</a></li>
<li><a href="#org5e97c3b">1.4. 類題:1999はfalse</a></li>
</ul>
</li>
<li><a href="#org30a1a2f">2. array, each</a>
<ul>
<li><a href="#orgd9632c9">2.1. お題:テストの自動化</a></li>
<li><a href="#org7bfd87a">2.2. 簡単な解説: array, each</a></li>
<li><a href="#org7779393">2.3. 詳しい解法1:1900はtrue? いえいえfalse</a></li>
<li><a href="#orgc7cf601">2.4. 詳しい解法2:refactoring 条件式の単純化</a></li>
<li><a href="#org1a71371">2.5. 類題:そして2000はtrue！</a></li>
<li><a href="#org086c62f">2.6. 類題:refactoring_methodに</a></li>
</ul>
</li>
<li><a href="#org8293e07">3. caseで</a>
<ul>
<li><a href="#orgec34beb">3.1. お題:case</a></li>
<li><a href="#orgfd48694">3.2. 簡単な解説</a></li>
<li><a href="#org2dac7b6">3.3. 類題</a></li>
</ul>
</li>
<li><a href="#org3749567">4. もっとすごいtdd</a></li>
<li><a href="#org4786640">5. TDD</a>
<ul>
<li><a href="#orgbca01ad">5.1. codingの最終目標</a></li>
<li><a href="#orgd10028c">5.2. clean code that works</a></li>
<li><a href="#orgbc88abb">5.3. phases and speed</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1fad229" class="outline-2">
<h2 id="org1fad229"><span class="section-number-2">1</span> if-elsif-else-end</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://qiita.com/daddygongon/items/6f38d9a04e127a7952a7">チャート式Ruby</a>の3回目，条件分岐とArray.eachです．
</p>
</div>

<div id="outline-container-org60b3396" class="outline-3">
<h3 id="org60b3396"><span class="section-number-3">1.1</span> お題はうるう年</h3>
<div class="outline-text-3" id="text-1-1">
<p>
うるう年の課題ってやったことありますよね．
</p>

<pre class="example">
入力がうるう年(leap year)かどうかを表示するプログラムをかけ．
1. うるう年は4で割り切れる数の年．ただし，
2. 100で割り切れる年はうるう年でなく，
3. 400で割り切れる年はうるう年．
4. 2004, 1999, 1900, 2000で試せ．
5. それぞれtrue, false, false, true
</pre>
<p>
この条件分岐をあらかじめ考えて実装するのってきつくなかったですか？
そいつをテスト駆動開発の順を追って見てもらいましょう．
</p>
</div>
</div>

<div id="outline-container-org105e6a5" class="outline-3">
<h3 id="org105e6a5"><span class="section-number-3">1.2</span> 簡単な解説:if-elsif-else-end</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://docs.ruby-lang.org/ja/index.html">https://docs.ruby-lang.org/ja/index.html</a>を読んで見てください．
これは，オブジェクト指向スクリプト言語 Ruby リファレンスマニュアルです．
文法は，rubyの使っているversionに合わせて中身を見てください．
そいつを開けて，「Rubyの文法:制御構造」の「条件分岐if」に「文法」として
次のような記述があります．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">if</span> &#24335; [<span style="color: #a020f0;">then</span>]
  &#24335; ...
[<span style="color: #a020f0;">elsif</span> &#24335; [<span style="color: #a020f0;">then</span>]
  &#24335; ... ]
...
[<span style="color: #a020f0;">else</span>
  &#24335; ... ]
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
その解説を「読めばわかる」と思うかもしれませんが，例を見るほうがいいかも．
ただし，上の表現で[]は省略可能箇所を示しています．
従って，最小で
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">if</span> year%4==0 <span style="color: #a020f0;">then</span>
  <span style="color: #483d8b;">p</span> <span style="color: #8b2252;">'not leap year'</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
とかになります．さらにthenは省略可能で，ifをつなげるのはelsifです．
</p>
</div>
</div>

<div id="outline-container-org2cebc58" class="outline-3">
<h3 id="org2cebc58"><span class="section-number-3">1.3</span> 詳しい解法:2004年はleap year</h3>
<div class="outline-text-3" id="text-1-3">
<p>
まずお題の4,5は振る舞いを記述する仕様(specification, spec)ではないですよね．例えば，
</p>
<pre class="example">
ruby check_leap_year.rb 2004
</pre>

<p>
とした時に
</p>
<pre class="example">
true
</pre>

<p>
と返ってきてほしいというテストの仕様です．
</p>

<p>
2004年の振る舞いだけを実装すると，
</p>

<p>
です．これをtestすると
</p>
<pre class="example">
&gt; ruby check_leap_2004.rb 2004
2004
true
</pre>
<p>
となります．
</p>
</div>
</div>

<div id="outline-container-org5e97c3b" class="outline-3">
<h3 id="org5e97c3b"><span class="section-number-3">1.4</span> 類題:1999はfalse</h3>
<div class="outline-text-3" id="text-1-4">
<p>
次に1999をtestすると
</p>
<pre class="example">
&gt; ruby check_leap_0.rb 1999
1999
</pre>
<p>
です．これをfalseと返すようにすると，
</p>

<p>
ちゃんと返ってます？
</p>
</div>
</div>
</div>

<div id="outline-container-org30a1a2f" class="outline-2">
<h2 id="org30a1a2f"><span class="section-number-2">2</span> array, each</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd9632c9" class="outline-3">
<h3 id="orgd9632c9"><span class="section-number-3">2.1</span> お題:テストの自動化</h3>
<div class="outline-text-3" id="text-2-1">
<p>
この後，さらにテストの内容が増えてくると，
いちいち引数(ARGV[0])で全てチェックするのが面倒になってきそうでしょ．
lazy programmerは二つ以上は耐えられません．
そこで，テストを自動化をしなさい．
</p>

<p>
なに，配列にしてloopで回すだけです．
</p>
<div class="org-src-container">
<pre class="src src-ruby">[2004, 1999].each <span style="color: #a020f0;">do</span> |year|
  <span style="color: #483d8b;">p</span> year
  <span style="color: #a020f0;">if</span> year%4 == 0
    <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">true</span>
  <span style="color: #a020f0;">else</span>
    <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">false</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7bfd87a" class="outline-3">
<h3 id="org7bfd87a"><span class="section-number-3">2.2</span> 簡単な解説: array, each</h3>
<div class="outline-text-3" id="text-2-2">
<p>
先ほどの<a href="https://docs.ruby-lang.org/ja/index.html">https://docs.ruby-lang.org/ja/index.html</a>で
何かを探すときはるりまサーチ(全文検索)へ行ってください．
そこで，Array#eachと検索を掛けてください．
</p>
<div class="org-src-container">
<pre class="src src-ruby">&#21508;&#35201;&#32032;&#12395;&#23550;&#12375;&#12390;&#12502;&#12525;&#12483;&#12463;&#12434;&#35413;&#20385;&#12375;&#12414;&#12377;&#12290;

&#12502;&#12525;&#12483;&#12463;&#12364;&#19982;&#12360;&#12425;&#12428;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#33258;&#36523;&#12392; each &#12363;&#12425;&#29983;&#25104;&#12375;&#12383;
<span style="color: #228b22;">Enumerator</span> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;

[1, 2, 3].each <span style="color: #a020f0;">do</span> |i|
<span style="color: #483d8b;">puts</span> i
<span style="color: #a020f0;">end</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">=&gt; 1</span>
2
3
</pre>
</div>
<p>
この記法では，出力が#=&gt;以下に記されています．
</p>

<p>
配列Arrayは[]で定義されます．
その中身を順番に処理するときには，上記のような
記法が用いられます．rubyでdo-loop内で使う値は'|i|'
のように縦棒で挟まれた変数名に入っていきます．
これはmethodで引数名を参照するのに似せた構文です．
</p>
</div>
</div>

<div id="outline-container-org7779393" class="outline-3">
<h3 id="org7779393"><span class="section-number-3">2.3</span> 詳しい解法1:1900はtrue? いえいえfalse</h3>
<div class="outline-text-3" id="text-2-3">
<p>
では次の
</p>
<pre class="example">
100で割り切れる年はうるう年でなく，
</pre>

<p>
ですが，1900はtrueが返って来るのをfalseが返るように変更します．
</p>

<p>
まずはテストの修正
</p>
<div class="org-src-container">
<pre class="src src-ruby">[1900, 2004, 1999].each <span style="color: #a020f0;">do</span> |year|
</pre>
</div>

<p>
次に100で割り切れる場合の処理です．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">if</span> year%100 == 0
  <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">false</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
なんですが，これをどこに入れるかで悩んでしまいます．
とりあえず別処理として前に付け加えておくと，
</p>

<p>
そしてtestです．
</p>
<pre class="example">
&gt; ruby check_leap_1900_2004_1999.rb 
1900
false
2004
true
1999
false
</pre>
<p>
うまいこと動いていますよね．
</p>
</div>
</div>
<div id="outline-container-orgc7cf601" class="outline-3">
<h3 id="orgc7cf601"><span class="section-number-3">2.4</span> 詳しい解法2:refactoring 条件式の単純化</h3>
<div class="outline-text-3" id="text-2-4">
<p>
先ほどの条件式は二つに完全に分けています．
でも，論理的にネスト(入れ子)にする方がいい場合もあります．
</p>
<div class="org-src-container">
<pre class="src src-ruby">[1900,2004,1999].each <span style="color: #a020f0;">do</span> |year|
  <span style="color: #483d8b;">p</span> year
  <span style="color: #a020f0;">if</span> year % 100 ==0
    <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">false</span>
  <span style="color: #a020f0;">else</span>
    <span style="color: #a020f0;">if</span> year % 4 == 0
      <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">true</span>
    <span style="color: #a020f0;">else</span>
      <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">false</span>
    <span style="color: #a020f0;">end</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
ですが，ここまでするとif 100 else .. endのelseを省略できることがわかるでしょ．
そうすると，
</p>
<div class="org-src-container">
<pre class="src src-ruby">[1900,2004,1999].each <span style="color: #a020f0;">do</span> |year|
  <span style="color: #483d8b;">p</span> year
  <span style="color: #a020f0;">if</span> year % 100 ==0
    <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">false</span>
  <span style="color: #a020f0;">elsif</span> year % 4 == 0
    <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">true</span>
  <span style="color: #a020f0;">else</span>
    <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">false</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
となります．
</p>
</div>
</div>
<div id="outline-container-org1a71371" class="outline-3">
<h3 id="org1a71371"><span class="section-number-3">2.5</span> 類題:そして2000はtrue！</h3>
<div class="outline-text-3" id="text-2-5">
<p>
最後の
</p>
<pre class="example">
3. 400で割り切れる年はうるう年．
</pre>

<p>
です．2000年はtrue?
</p>
</div>
</div>

<div id="outline-container-org086c62f" class="outline-3">
<h3 id="org086c62f"><span class="section-number-3">2.6</span> 類題:refactoring_methodに</h3>
<div class="outline-text-3" id="text-2-6">
<p>
次はmethodにしたくなりますよね．関数の名前はleap?
としましょう．
</p>

<p>
です．true falseを返して，main loopでpする方がいいです．
</p>
</div>
</div>
</div>

<div id="outline-container-org8293e07" class="outline-2">
<h2 id="org8293e07"><span class="section-number-2">3</span> caseで</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgec34beb" class="outline-3">
<h3 id="orgec34beb"><span class="section-number-3">3.1</span> お題:case</h3>
<div class="outline-text-3" id="text-3-1">
<p>
ここまででも十分に綺麗なのですが，もっと綺麗にかけます．
caseを使って短くせよ．
</p>
</div>
</div>

<div id="outline-container-orgfd48694" class="outline-3">
<h3 id="orgfd48694"><span class="section-number-3">3.2</span> 簡単な解説</h3>
<div class="outline-text-3" id="text-3-2">
<p>
先ほどの<a href="https://docs.ruby-lang.org/ja/2.5.0/doc/spec=2fcontrol.html#if">reference manualのif</a>の下の方にcaseの解説があります．文法は
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">case</span> [&#24335;]
[<span style="color: #a020f0;">when</span> &#24335; [, &#24335;] ...[, <span style="color: #8b2252;">`*' &#24335;] [then]</span>
<span style="color: #8b2252;">  &#24335;..]..</span>
<span style="color: #8b2252;">[when `</span>*<span style="color: #8b2252;">' &#24335; [then]</span>
<span style="color: #8b2252;">  &#24335;..]..</span>
<span style="color: #8b2252;">[else</span>
<span style="color: #8b2252;">  &#24335;..]</span>
<span style="color: #8b2252;">end</span>
</pre>
</div>
<p>
です．そこにある例も参照してください．
ちょっと例と違うのは，普通は0番の式を共通にして一致判定をするのですが，
それを省略して一致判定をしてもいいというところです．
</p>
</div>
</div>

<div id="outline-container-org2dac7b6" class="outline-3">
<h3 id="org2dac7b6"><span class="section-number-3">3.3</span> 類題</h3>
<div class="outline-text-3" id="text-3-3">
<p>
ちゃんと動くのは，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">leap?</span>(year)
  <span style="color: #a020f0;">case</span>
  <span style="color: #a020f0;">when</span> year % 400 ==0 ; <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">true</span>
  <span style="color: #a020f0;">when</span> year % 100 ==0 ; <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">false</span>
  <span style="color: #a020f0;">when</span> year % 4 ==0 ;   <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">true</span>
  <span style="color: #a020f0;">else</span> ;                 <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">false</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
です．
</p>
</div>
</div>
</div>

<div id="outline-container-org3749567" class="outline-2">
<h2 id="org3749567"><span class="section-number-2">4</span> もっとすごいtdd</h2>
<div class="outline-text-2" id="text-4">
<p>
上の知識があると全く逆からのtddも可能です．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">leap?</span>(year)
  <span style="color: #a020f0;">case</span> 
  <span style="color: #a020f0;">when</span> year == 2000 ; <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">true</span>
  <span style="color: #a020f0;">when</span> year == 1900 ; <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">false</span>
  <span style="color: #a020f0;">when</span> year == 2004 ; <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">true</span>
  <span style="color: #a020f0;">else</span>              ; <span style="color: #483d8b;">p</span> <span style="color: #008b8b;">false</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
ですよね．この後，より一般化して，
</p>
<pre class="example">
2000 -&gt; % 400 == 0
</pre>

<p>
とかにしても問題ありません．
</p>

<p>
さらに，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">leap?</span>(year)
  <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">case</span>
         <span style="color: #a020f0;">when</span> year % 400 ==0 ; <span style="color: #008b8b;">true</span>
         <span style="color: #a020f0;">when</span> year % 100 ==0 ; <span style="color: #008b8b;">false</span>
         <span style="color: #a020f0;">when</span> year % 4 ==0   ; <span style="color: #008b8b;">true</span>
         <span style="color: #a020f0;">else</span>                ; <span style="color: #008b8b;">false</span>
         <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
<p>
とするといいかも．これは確認済み．
</p>
</div>
</div>

<div id="outline-container-org4786640" class="outline-2">
<h2 id="org4786640"><span class="section-number-2">5</span> TDD</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgbca01ad" class="outline-3">
<h3 id="orgbca01ad"><span class="section-number-3">5.1</span> codingの最終目標</h3>
<div class="outline-text-3" id="text-5-1">
<p>
こういうcodingの仕方はTDD(Test Driven Development:テスト駆動開発)
と呼ばれています．
</p>

<ul class="org-ul">
<li>テストを作る</li>
<li>エラーを出す(red)</li>
<li>エラーをなくす(green)</li>
<li>codeを綺麗にする(refactoring)</li>
</ul>
<p>
です．codingの最終目標は
</p>
<pre class="example">
clean code that works
</pre>

<p>
動く綺麗なコードを作ることです．
順番は，まず動かして，それからこそこそと綺麗にするです．
えっと，もし，あなたが，
</p>
<ul class="org-ul">
<li>codeを書くまえに設計すべき</li>
<li>コピペは悪</li>
</ul>
<p>
なんていう，マントラを信じているなら
このprogramming styleを提唱し始めたKent Beckの文章を
載せておきます．よーーく心に刻んでください．
</p>

<p>
もしあなたがプログラミング嫌いならば，
少し心が晴れると思いますよ．俺のせいじゃないって．
</p>
</div>
</div>

<div id="outline-container-orgd10028c" class="outline-3">
<h3 id="orgd10028c"><span class="section-number-3">5.2</span> clean code that works</h3>
<div class="outline-text-3" id="text-5-2">
<p>
TDD by Example (Kent Beck) p.13
</p>
<blockquote>
<p>
目指すのは，動作するきれいなコードだ
(このRon Jeffriesの簡潔な表現は素晴らしい).
動作するきれいなコードは，偉大なプログラマでも
すぐには書けないことがあるし，
普通のプログラマならなおさらだ(私もそうだ)．
<code>=ここは分割統治しよう．=</code>
各個撃破だぜ，ベイビー.
最初に「動作する」に取り組み，
その後で「きれいな」に取り組む．
この方法はアーキテクチャ駆動とは正反対だ．
アーキテクチャ駆動は「きれいなコード」に最初に取り組み，
そのうえで苦心してあちこち設計の辻褄を
合わせながらどうにか「動作する」を実現させる．
</p>
</blockquote>

<p>
TDD by Example (Kent Beck) p.11
</p>
<blockquote>
<p>
The goal is clean code that works
(thenks to Ron Jeffries for this pithy summary).
Clean code that works is out of the reach of even the best programmers
some of the time,
and out of the reach of most programmers(like me)
most of the time.
Divide and conquer, baby.
First we'll solve the "that works" part of the problem.
Then we'll solve the "clean code" part.
This is the opposite of architecture-driven development,
where you solve "clean code" first,
then scramble around trying to integrate into the design the things you learn 
as you solve the "that works" problem.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgbc88abb" class="outline-3">
<h3 id="orgbc88abb"><span class="section-number-3">5.3</span> phases and speed</h3>
<div class="outline-text-3" id="text-5-3">
<p>
TDD by Example (Kent Beck) p.30
</p>
<blockquote>
<p>
グリーンバーを出す小さなステップはどんなものだろうか．
Dollarクラスを丸ごとコピーして，
DollarをFrancに書き換えるのはどうだろう．
</p>

<p>
ちょっと待った．
これで唾棄すべき糞コードの出来上がりだと
あざ笑う声が聞こえる．
その声は続けて言う．
コピー&amp;ペーストによる再利用は
抽象化の敗北であり，きれいな設計を殺すと．
</p>

<p>
イラっとしただろうか．なら深呼吸だ．
鼻から息を吸い込んで，3秒止めて口から吐き出す．
オーケー？
さて，サイクルにはフェーズがあることを思い出してほしい
(中には数秒で通り過ぎるものもあるが，フェーズはフェーズだ)．
</p>
<ol class="org-ol">
<li>テストを書く．</li>
<li>コンパイラを通す．</li>
<li>テストを走らせ，失敗を確認する．</li>
<li>テストを通す．</li>
<li>重複を排除する．</li>
</ol>


<p>
各フェーズにはフェーズなりの目的と解決法があり，
価値観も異なっている．
最初の３つのフェーズはなるべく速く通過して，
新しい機能がどの状態にあるのかわかるところまで行きたい．
そこにたどり着くためには，どのような罪をおかしてもよい．
その短い時間だけは，速度が設計よりも重要だからだ．
</p>

<p>
１つ心配なのは，私がここに書いていることが，
良い設計の原則を無視してよいという免罪符になってしまうことだ．
チームに対して
「Kent Beckが設計なんてどうでもいいって書いてたよ」
などと言い始めるのは，ちょっと待ってほしい．
サイクルはまだ終わっていない．
4つ足のアーロンチェアは倒れる．
最初の4つのステップは，5つ目がなければ無意味だ．
正しい設計を，正しいタイミングで行う．
動かしてから，正しくする．
</p>

<p>
ここまで言っておけば安心だろう．
これで読者の皆さんは重複を排除するまで
誰にもコードを見せないはずだ
(ただし，ペアプロ相手は除く)
</p>
</blockquote>

<p>
TDD by Example (Kent Beck) p.23
</p>
<blockquote>
<p>
What short step will get us to a green bar?
Copying the Dollar code and replacing Dollar with Franc.
</p>

<p>
Stop.  Hold on.
I can hear the aesthetically inclined among you sneering and spitting.
Copy-and-paste reuse?
The death of abstraction?
The killer of clean design?
</p>

<p>
If you're upset, take a cleanthing breath.
In through the nose &#x2026; 
hold it 1, 2, 3&#x2026; out through the mouth.
There. Remember, our cycle has different phases
(they go by quickly, often in seconds, but they are phases.):
</p>
<ol class="org-ol">
<li>Write a test.
<ol class="org-ol">
<li>Make it compile.</li>
<li>Run it to see that it fails.</li>
</ol></li>
<li>Make it run.</li>
<li>Remove duplication.
(Make it right.)</li>
</ol>

<p>
The different phases have different purposes.
They call for different styles of solution, different aesthetic viewpoints.
The first three phases need to go by quickly,
so we get to a known state with the new functionality.
We can commit any number of sins to get there,
because speed trumps design,
just for that brief moment.
</p>

<p>
Now I'm worried.
I've given you a license to abandon all the principles of good design.
Off you go to your teams &#x2013;
"Kent says all that design stuff doesn't matter."
Halt.  The cycle is not complete.
A four-legged Aeron chair falls over.
The first four steps of the cycle won't work without the fifth.
Good design at good times.
Make it run, make it right.
</p>

<p>
There, I feel better.
Now I'm sure you won't show anyone except your partner your code
until you've removed the duplication.
Where were we?
Ah, yes.
Violating all the tenets of good design in the interest of speed
(penance for our sin will occupy the next several chapters).
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2024-10-21 Mon 10:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
